grevaillot/svd_tools/headers/ATSAM3X8H/tc2.h
#pragma once 

/* --- TC2: Timer Counter 2 ----------------------------------------- */

/** @defgroup tc2_registers Timer Counter 2 Register
@{*/

/** TC2_CCR0 Channel Control Register (channel = 0) **/
#define TC2_CCR0			MMIO32(TC2_BASE + 0x00)
/** TC2_CMR0 Channel Mode Register (channel = 0) **/
#define TC2_CMR0			MMIO32(TC2_BASE + 0x04)
/** TC2_CMR0_WAVE_EQ_1 Channel Mode Register (channel = 0) **/
#define TC2_CMR0_WAVE_EQ_1			MMIO32(TC2_BASE + 0x04)
/** TC2_SMMR0 Stepper Motor Mode Register (channel = 0) **/
#define TC2_SMMR0			MMIO32(TC2_BASE + 0x08)
/** TC2_CV0 Counter Value (channel = 0) **/
#define TC2_CV0			MMIO32(TC2_BASE + 0x10)
/** TC2_RA0 Register A (channel = 0) **/
#define TC2_RA0			MMIO32(TC2_BASE + 0x14)
/** TC2_RB0 Register B (channel = 0) **/
#define TC2_RB0			MMIO32(TC2_BASE + 0x18)
/** TC2_RC0 Register C (channel = 0) **/
#define TC2_RC0			MMIO32(TC2_BASE + 0x1c)
/** TC2_SR0 Status Register (channel = 0) **/
#define TC2_SR0			MMIO32(TC2_BASE + 0x20)
/** TC2_IER0 Interrupt Enable Register (channel = 0) **/
#define TC2_IER0			MMIO32(TC2_BASE + 0x24)
/** TC2_IDR0 Interrupt Disable Register (channel = 0) **/
#define TC2_IDR0			MMIO32(TC2_BASE + 0x28)
/** TC2_IMR0 Interrupt Mask Register (channel = 0) **/
#define TC2_IMR0			MMIO32(TC2_BASE + 0x2c)
/** TC2_CCR1 Channel Control Register (channel = 1) **/
#define TC2_CCR1			MMIO32(TC2_BASE + 0x40)
/** TC2_CMR1 Channel Mode Register (channel = 1) **/
#define TC2_CMR1			MMIO32(TC2_BASE + 0x44)
/** TC2_CMR1_WAVE_EQ_1 Channel Mode Register (channel = 1) **/
#define TC2_CMR1_WAVE_EQ_1			MMIO32(TC2_BASE + 0x44)
/** TC2_SMMR1 Stepper Motor Mode Register (channel = 1) **/
#define TC2_SMMR1			MMIO32(TC2_BASE + 0x48)
/** TC2_CV1 Counter Value (channel = 1) **/
#define TC2_CV1			MMIO32(TC2_BASE + 0x50)
/** TC2_RA1 Register A (channel = 1) **/
#define TC2_RA1			MMIO32(TC2_BASE + 0x54)
/** TC2_RB1 Register B (channel = 1) **/
#define TC2_RB1			MMIO32(TC2_BASE + 0x58)
/** TC2_RC1 Register C (channel = 1) **/
#define TC2_RC1			MMIO32(TC2_BASE + 0x5c)
/** TC2_SR1 Status Register (channel = 1) **/
#define TC2_SR1			MMIO32(TC2_BASE + 0x60)
/** TC2_IER1 Interrupt Enable Register (channel = 1) **/
#define TC2_IER1			MMIO32(TC2_BASE + 0x64)
/** TC2_IDR1 Interrupt Disable Register (channel = 1) **/
#define TC2_IDR1			MMIO32(TC2_BASE + 0x68)
/** TC2_IMR1 Interrupt Mask Register (channel = 1) **/
#define TC2_IMR1			MMIO32(TC2_BASE + 0x6c)
/** TC2_CCR2 Channel Control Register (channel = 2) **/
#define TC2_CCR2			MMIO32(TC2_BASE + 0x80)
/** TC2_CMR2 Channel Mode Register (channel = 2) **/
#define TC2_CMR2			MMIO32(TC2_BASE + 0x84)
/** TC2_CMR2_WAVE_EQ_1 Channel Mode Register (channel = 2) **/
#define TC2_CMR2_WAVE_EQ_1			MMIO32(TC2_BASE + 0x84)
/** TC2_SMMR2 Stepper Motor Mode Register (channel = 2) **/
#define TC2_SMMR2			MMIO32(TC2_BASE + 0x88)
/** TC2_CV2 Counter Value (channel = 2) **/
#define TC2_CV2			MMIO32(TC2_BASE + 0x90)
/** TC2_RA2 Register A (channel = 2) **/
#define TC2_RA2			MMIO32(TC2_BASE + 0x94)
/** TC2_RB2 Register B (channel = 2) **/
#define TC2_RB2			MMIO32(TC2_BASE + 0x98)
/** TC2_RC2 Register C (channel = 2) **/
#define TC2_RC2			MMIO32(TC2_BASE + 0x9c)
/** TC2_SR2 Status Register (channel = 2) **/
#define TC2_SR2			MMIO32(TC2_BASE + 0xa0)
/** TC2_IER2 Interrupt Enable Register (channel = 2) **/
#define TC2_IER2			MMIO32(TC2_BASE + 0xa4)
/** TC2_IDR2 Interrupt Disable Register (channel = 2) **/
#define TC2_IDR2			MMIO32(TC2_BASE + 0xa8)
/** TC2_IMR2 Interrupt Mask Register (channel = 2) **/
#define TC2_IMR2			MMIO32(TC2_BASE + 0xac)
/** TC2_BCR Block Control Register **/
#define TC2_BCR			MMIO32(TC2_BASE + 0xc0)
/** TC2_BMR Block Mode Register **/
#define TC2_BMR			MMIO32(TC2_BASE + 0xc4)
/** TC2_QIER QDEC Interrupt Enable Register **/
#define TC2_QIER			MMIO32(TC2_BASE + 0xc8)
/** TC2_QIDR QDEC Interrupt Disable Register **/
#define TC2_QIDR			MMIO32(TC2_BASE + 0xcc)
/** TC2_QIMR QDEC Interrupt Mask Register **/
#define TC2_QIMR			MMIO32(TC2_BASE + 0xd0)
/** TC2_QISR QDEC Interrupt Status Register **/
#define TC2_QISR			MMIO32(TC2_BASE + 0xd4)
/** TC2_FMR Fault Mode Register **/
#define TC2_FMR			MMIO32(TC2_BASE + 0xd8)
/** TC2_WPMR Write Protect Mode Register **/
#define TC2_WPMR			MMIO32(TC2_BASE + 0xe4)

/**@}*/


/** @defgroup tc2_ccr0 CCR0 Channel Control Register (channel = 0)
@{*/

/** TC2_CCR0_SWTRG Software Trigger Command **/
#define TC2_CCR0_SWTRG		(1 << 2)
/** TC2_CCR0_CLKDIS Counter Clock Disable Command **/
#define TC2_CCR0_CLKDIS		(1 << 1)
/** TC2_CCR0_CLKEN Counter Clock Enable Command **/
#define TC2_CCR0_CLKEN		(1 << 0)

/**@}*/

/** @defgroup tc2_cmr0 CMR0 Channel Mode Register (channel = 0)
@{*/


#define TC2_CMR0_LDRB_SHIFT		18
#define TC2_CMR0_LDRB_MASK		0x03
/** @defgroup tc2_cmr0_ldrb LDRB RB Loading Edge Selection
@{*/
/**@}*/


#define TC2_CMR0_LDRA_SHIFT		16
#define TC2_CMR0_LDRA_MASK		0x03
/** @defgroup tc2_cmr0_ldra LDRA RA Loading Edge Selection
@{*/
/**@}*/

/** TC2_CMR0_WAVE Waveform Mode **/
#define TC2_CMR0_WAVE		(1 << 15)
/** TC2_CMR0_CPCTRG RC Compare Trigger Enable **/
#define TC2_CMR0_CPCTRG		(1 << 14)
/** TC2_CMR0_ABETRG TIOA or TIOB External Trigger Selection **/
#define TC2_CMR0_ABETRG		(1 << 10)

#define TC2_CMR0_ETRGEDG_SHIFT		8
#define TC2_CMR0_ETRGEDG_MASK		0x03
/** @defgroup tc2_cmr0_etrgedg ETRGEDG External Trigger Edge Selection
@{*/
/**@}*/

/** TC2_CMR0_LDBDIS Counter Clock Disable with RB Loading **/
#define TC2_CMR0_LDBDIS		(1 << 7)
/** TC2_CMR0_LDBSTOP Counter Clock Stopped with RB Loading **/
#define TC2_CMR0_LDBSTOP		(1 << 6)

#define TC2_CMR0_BURST_SHIFT		4
#define TC2_CMR0_BURST_MASK		0x03
/** @defgroup tc2_cmr0_burst BURST Burst Signal Selection
@{*/
/**@}*/

/** TC2_CMR0_CLKI Clock Invert **/
#define TC2_CMR0_CLKI		(1 << 3)

#define TC2_CMR0_TCCLKS_SHIFT		0
#define TC2_CMR0_TCCLKS_MASK		0x07
/** @defgroup tc2_cmr0_tcclks TCCLKS Clock Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup tc2_cmr0_wave_eq_1 CMR0WAVEEQ1 Channel Mode Register (channel = 0)
@{*/


#define TC2_CMR0_WAVE_EQ_1_BSWTRG_SHIFT		30
#define TC2_CMR0_WAVE_EQ_1_BSWTRG_MASK		0x03
/** @defgroup tc2_cmr0_wave_eq_1_bswtrg BSWTRG Software Trigger Effect on TIOB
@{*/
/**@}*/


#define TC2_CMR0_WAVE_EQ_1_BEEVT_SHIFT		28
#define TC2_CMR0_WAVE_EQ_1_BEEVT_MASK		0x03
/** @defgroup tc2_cmr0_wave_eq_1_beevt BEEVT External Event Effect on TIOB
@{*/
/**@}*/


