grevaillot/svd_tools/headers/ATSAM3X8H/tc2.h
#define TC2_CMR0_WAVE_EQ_1_BCPC_SHIFT		26
#define TC2_CMR0_WAVE_EQ_1_BCPC_MASK		0x03
/** @defgroup tc2_cmr0_wave_eq_1_bcpc BCPC RC Compare Effect on TIOB
@{*/
/**@}*/


#define TC2_CMR0_WAVE_EQ_1_BCPB_SHIFT		24
#define TC2_CMR0_WAVE_EQ_1_BCPB_MASK		0x03
/** @defgroup tc2_cmr0_wave_eq_1_bcpb BCPB RB Compare Effect on TIOB
@{*/
/**@}*/


#define TC2_CMR0_WAVE_EQ_1_ASWTRG_SHIFT		22
#define TC2_CMR0_WAVE_EQ_1_ASWTRG_MASK		0x03
/** @defgroup tc2_cmr0_wave_eq_1_aswtrg ASWTRG Software Trigger Effect on TIOA
@{*/
/**@}*/


#define TC2_CMR0_WAVE_EQ_1_AEEVT_SHIFT		20
#define TC2_CMR0_WAVE_EQ_1_AEEVT_MASK		0x03
/** @defgroup tc2_cmr0_wave_eq_1_aeevt AEEVT External Event Effect on TIOA
@{*/
/**@}*/


#define TC2_CMR0_WAVE_EQ_1_ACPC_SHIFT		18
#define TC2_CMR0_WAVE_EQ_1_ACPC_MASK		0x03
/** @defgroup tc2_cmr0_wave_eq_1_acpc ACPC RC Compare Effect on TIOA
@{*/
/**@}*/


#define TC2_CMR0_WAVE_EQ_1_ACPA_SHIFT		16
#define TC2_CMR0_WAVE_EQ_1_ACPA_MASK		0x03
/** @defgroup tc2_cmr0_wave_eq_1_acpa ACPA RA Compare Effect on TIOA
@{*/
/**@}*/

/** TC2_CMR0_WAVE_EQ_1_WAVE Waveform Mode **/
#define TC2_CMR0_WAVE_EQ_1_WAVE		(1 << 15)

#define TC2_CMR0_WAVE_EQ_1_WAVSEL_SHIFT		13
#define TC2_CMR0_WAVE_EQ_1_WAVSEL_MASK		0x03
/** @defgroup tc2_cmr0_wave_eq_1_wavsel WAVSEL Waveform Selection
@{*/
/**@}*/

/** TC2_CMR0_WAVE_EQ_1_ENETRG External Event Trigger Enable **/
#define TC2_CMR0_WAVE_EQ_1_ENETRG		(1 << 12)

#define TC2_CMR0_WAVE_EQ_1_EEVT_SHIFT		10
#define TC2_CMR0_WAVE_EQ_1_EEVT_MASK		0x03
/** @defgroup tc2_cmr0_wave_eq_1_eevt EEVT External Event Selection
@{*/
/**@}*/


#define TC2_CMR0_WAVE_EQ_1_EEVTEDG_SHIFT		8
#define TC2_CMR0_WAVE_EQ_1_EEVTEDG_MASK		0x03
/** @defgroup tc2_cmr0_wave_eq_1_eevtedg EEVTEDG External Event Edge Selection
@{*/
/**@}*/

/** TC2_CMR0_WAVE_EQ_1_CPCDIS Counter Clock Disable with RC Compare **/
#define TC2_CMR0_WAVE_EQ_1_CPCDIS		(1 << 7)
/** TC2_CMR0_WAVE_EQ_1_CPCSTOP Counter Clock Stopped with RC Compare **/
#define TC2_CMR0_WAVE_EQ_1_CPCSTOP		(1 << 6)

#define TC2_CMR0_WAVE_EQ_1_BURST_SHIFT		4
#define TC2_CMR0_WAVE_EQ_1_BURST_MASK		0x03
/** @defgroup tc2_cmr0_wave_eq_1_burst BURST Burst Signal Selection
@{*/
/**@}*/

/** TC2_CMR0_WAVE_EQ_1_CLKI Clock Invert **/
#define TC2_CMR0_WAVE_EQ_1_CLKI		(1 << 3)

#define TC2_CMR0_WAVE_EQ_1_TCCLKS_SHIFT		0
#define TC2_CMR0_WAVE_EQ_1_TCCLKS_MASK		0x07
/** @defgroup tc2_cmr0_wave_eq_1_tcclks TCCLKS Clock Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup tc2_smmr0 SMMR0 Stepper Motor Mode Register (channel = 0)
@{*/

/** TC2_SMMR0_DOWN DOWN Count **/
#define TC2_SMMR0_DOWN		(1 << 1)
/** TC2_SMMR0_GCEN Gray Count Enable **/
#define TC2_SMMR0_GCEN		(1 << 0)

/**@}*/

/** @defgroup tc2_cv0 CV0 Counter Value (channel = 0)
@{*/


#define TC2_CV0_CV_SHIFT		0
#define TC2_CV0_CV_MASK		0xffffffff
/** @defgroup tc2_cv0_cv CV Counter Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tc2_ra0 RA0 Register A (channel = 0)
@{*/


#define TC2_RA0_RA_SHIFT		0
#define TC2_RA0_RA_MASK		0xffffffff
/** @defgroup tc2_ra0_ra RA Register A
@{*/
/**@}*/


/**@}*/

/** @defgroup tc2_rb0 RB0 Register B (channel = 0)
@{*/


#define TC2_RB0_RB_SHIFT		0
#define TC2_RB0_RB_MASK		0xffffffff
/** @defgroup tc2_rb0_rb RB Register B
@{*/
/**@}*/


/**@}*/

/** @defgroup tc2_rc0 RC0 Register C (channel = 0)
@{*/


#define TC2_RC0_RC_SHIFT		0
#define TC2_RC0_RC_MASK		0xffffffff
/** @defgroup tc2_rc0_rc RC Register C
@{*/
/**@}*/


/**@}*/

/** @defgroup tc2_sr0 SR0 Status Register (channel = 0)
@{*/

/** TC2_SR0_MTIOB TIOB Mirror **/
#define TC2_SR0_MTIOB		(1 << 18)
/** TC2_SR0_MTIOA TIOA Mirror **/
#define TC2_SR0_MTIOA		(1 << 17)
/** TC2_SR0_CLKSTA Clock Enabling Status **/
#define TC2_SR0_CLKSTA		(1 << 16)
/** TC2_SR0_ETRGS External Trigger Status **/
#define TC2_SR0_ETRGS		(1 << 7)
/** TC2_SR0_LDRBS RB Loading Status **/
#define TC2_SR0_LDRBS		(1 << 6)
/** TC2_SR0_LDRAS RA Loading Status **/
#define TC2_SR0_LDRAS		(1 << 5)
/** TC2_SR0_CPCS RC Compare Status **/
#define TC2_SR0_CPCS		(1 << 4)
/** TC2_SR0_CPBS RB Compare Status **/
#define TC2_SR0_CPBS		(1 << 3)
/** TC2_SR0_CPAS RA Compare Status **/
#define TC2_SR0_CPAS		(1 << 2)
/** TC2_SR0_LOVRS Load Overrun Status **/
#define TC2_SR0_LOVRS		(1 << 1)
/** TC2_SR0_COVFS Counter Overflow Status **/
#define TC2_SR0_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc2_ier0 IER0 Interrupt Enable Register (channel = 0)
@{*/

/** TC2_IER0_ETRGS External Trigger **/
#define TC2_IER0_ETRGS		(1 << 7)
/** TC2_IER0_LDRBS RB Loading **/
#define TC2_IER0_LDRBS		(1 << 6)
/** TC2_IER0_LDRAS RA Loading **/
#define TC2_IER0_LDRAS		(1 << 5)
/** TC2_IER0_CPCS RC Compare **/
#define TC2_IER0_CPCS		(1 << 4)
/** TC2_IER0_CPBS RB Compare **/
#define TC2_IER0_CPBS		(1 << 3)
/** TC2_IER0_CPAS RA Compare **/
#define TC2_IER0_CPAS		(1 << 2)
/** TC2_IER0_LOVRS Load Overrun **/
#define TC2_IER0_LOVRS		(1 << 1)
/** TC2_IER0_COVFS Counter Overflow **/
#define TC2_IER0_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc2_idr0 IDR0 Interrupt Disable Register (channel = 0)
@{*/

/** TC2_IDR0_ETRGS External Trigger **/
#define TC2_IDR0_ETRGS		(1 << 7)
/** TC2_IDR0_LDRBS RB Loading **/
#define TC2_IDR0_LDRBS		(1 << 6)
/** TC2_IDR0_LDRAS RA Loading **/
#define TC2_IDR0_LDRAS		(1 << 5)
/** TC2_IDR0_CPCS RC Compare **/
#define TC2_IDR0_CPCS		(1 << 4)
/** TC2_IDR0_CPBS RB Compare **/
#define TC2_IDR0_CPBS		(1 << 3)
/** TC2_IDR0_CPAS RA Compare **/
#define TC2_IDR0_CPAS		(1 << 2)
/** TC2_IDR0_LOVRS Load Overrun **/
#define TC2_IDR0_LOVRS		(1 << 1)
/** TC2_IDR0_COVFS Counter Overflow **/
#define TC2_IDR0_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc2_imr0 IMR0 Interrupt Mask Register (channel = 0)
@{*/

/** TC2_IMR0_ETRGS External Trigger **/
#define TC2_IMR0_ETRGS		(1 << 7)
/** TC2_IMR0_LDRBS RB Loading **/
#define TC2_IMR0_LDRBS		(1 << 6)
/** TC2_IMR0_LDRAS RA Loading **/
#define TC2_IMR0_LDRAS		(1 << 5)
/** TC2_IMR0_CPCS RC Compare **/
#define TC2_IMR0_CPCS		(1 << 4)
/** TC2_IMR0_CPBS RB Compare **/
#define TC2_IMR0_CPBS		(1 << 3)
/** TC2_IMR0_CPAS RA Compare **/
#define TC2_IMR0_CPAS		(1 << 2)
/** TC2_IMR0_LOVRS Load Overrun **/
#define TC2_IMR0_LOVRS		(1 << 1)
/** TC2_IMR0_COVFS Counter Overflow **/
#define TC2_IMR0_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc2_ccr1 CCR1 Channel Control Register (channel = 1)
@{*/

/** TC2_CCR1_SWTRG Software Trigger Command **/
#define TC2_CCR1_SWTRG		(1 << 2)
/** TC2_CCR1_CLKDIS Counter Clock Disable Command **/
#define TC2_CCR1_CLKDIS		(1 << 1)
/** TC2_CCR1_CLKEN Counter Clock Enable Command **/
#define TC2_CCR1_CLKEN		(1 << 0)

/**@}*/

