grevaillot/svd_tools/headers/ATSAM3X8H/tc2.h
/** @defgroup tc2_cmr1 CMR1 Channel Mode Register (channel = 1)
@{*/


#define TC2_CMR1_LDRB_SHIFT		18
#define TC2_CMR1_LDRB_MASK		0x03
/** @defgroup tc2_cmr1_ldrb LDRB RB Loading Edge Selection
@{*/
/**@}*/


#define TC2_CMR1_LDRA_SHIFT		16
#define TC2_CMR1_LDRA_MASK		0x03
/** @defgroup tc2_cmr1_ldra LDRA RA Loading Edge Selection
@{*/
/**@}*/

/** TC2_CMR1_WAVE Waveform Mode **/
#define TC2_CMR1_WAVE		(1 << 15)
/** TC2_CMR1_CPCTRG RC Compare Trigger Enable **/
#define TC2_CMR1_CPCTRG		(1 << 14)
/** TC2_CMR1_ABETRG TIOA or TIOB External Trigger Selection **/
#define TC2_CMR1_ABETRG		(1 << 10)

#define TC2_CMR1_ETRGEDG_SHIFT		8
#define TC2_CMR1_ETRGEDG_MASK		0x03
/** @defgroup tc2_cmr1_etrgedg ETRGEDG External Trigger Edge Selection
@{*/
/**@}*/

/** TC2_CMR1_LDBDIS Counter Clock Disable with RB Loading **/
#define TC2_CMR1_LDBDIS		(1 << 7)
/** TC2_CMR1_LDBSTOP Counter Clock Stopped with RB Loading **/
#define TC2_CMR1_LDBSTOP		(1 << 6)

#define TC2_CMR1_BURST_SHIFT		4
#define TC2_CMR1_BURST_MASK		0x03
/** @defgroup tc2_cmr1_burst BURST Burst Signal Selection
@{*/
/**@}*/

/** TC2_CMR1_CLKI Clock Invert **/
#define TC2_CMR1_CLKI		(1 << 3)

#define TC2_CMR1_TCCLKS_SHIFT		0
#define TC2_CMR1_TCCLKS_MASK		0x07
/** @defgroup tc2_cmr1_tcclks TCCLKS Clock Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup tc2_cmr1_wave_eq_1 CMR1WAVEEQ1 Channel Mode Register (channel = 1)
@{*/


#define TC2_CMR1_WAVE_EQ_1_BSWTRG_SHIFT		30
#define TC2_CMR1_WAVE_EQ_1_BSWTRG_MASK		0x03
/** @defgroup tc2_cmr1_wave_eq_1_bswtrg BSWTRG Software Trigger Effect on TIOB
@{*/
/**@}*/


#define TC2_CMR1_WAVE_EQ_1_BEEVT_SHIFT		28
#define TC2_CMR1_WAVE_EQ_1_BEEVT_MASK		0x03
/** @defgroup tc2_cmr1_wave_eq_1_beevt BEEVT External Event Effect on TIOB
@{*/
/**@}*/


#define TC2_CMR1_WAVE_EQ_1_BCPC_SHIFT		26
#define TC2_CMR1_WAVE_EQ_1_BCPC_MASK		0x03
/** @defgroup tc2_cmr1_wave_eq_1_bcpc BCPC RC Compare Effect on TIOB
@{*/
/**@}*/


#define TC2_CMR1_WAVE_EQ_1_BCPB_SHIFT		24
#define TC2_CMR1_WAVE_EQ_1_BCPB_MASK		0x03
/** @defgroup tc2_cmr1_wave_eq_1_bcpb BCPB RB Compare Effect on TIOB
@{*/
/**@}*/


#define TC2_CMR1_WAVE_EQ_1_ASWTRG_SHIFT		22
#define TC2_CMR1_WAVE_EQ_1_ASWTRG_MASK		0x03
/** @defgroup tc2_cmr1_wave_eq_1_aswtrg ASWTRG Software Trigger Effect on TIOA
@{*/
/**@}*/


#define TC2_CMR1_WAVE_EQ_1_AEEVT_SHIFT		20
#define TC2_CMR1_WAVE_EQ_1_AEEVT_MASK		0x03
/** @defgroup tc2_cmr1_wave_eq_1_aeevt AEEVT External Event Effect on TIOA
@{*/
/**@}*/


#define TC2_CMR1_WAVE_EQ_1_ACPC_SHIFT		18
#define TC2_CMR1_WAVE_EQ_1_ACPC_MASK		0x03
/** @defgroup tc2_cmr1_wave_eq_1_acpc ACPC RC Compare Effect on TIOA
@{*/
/**@}*/


#define TC2_CMR1_WAVE_EQ_1_ACPA_SHIFT		16
#define TC2_CMR1_WAVE_EQ_1_ACPA_MASK		0x03
/** @defgroup tc2_cmr1_wave_eq_1_acpa ACPA RA Compare Effect on TIOA
@{*/
/**@}*/

/** TC2_CMR1_WAVE_EQ_1_WAVE Waveform Mode **/
#define TC2_CMR1_WAVE_EQ_1_WAVE		(1 << 15)

#define TC2_CMR1_WAVE_EQ_1_WAVSEL_SHIFT		13
#define TC2_CMR1_WAVE_EQ_1_WAVSEL_MASK		0x03
/** @defgroup tc2_cmr1_wave_eq_1_wavsel WAVSEL Waveform Selection
@{*/
/**@}*/

/** TC2_CMR1_WAVE_EQ_1_ENETRG External Event Trigger Enable **/
#define TC2_CMR1_WAVE_EQ_1_ENETRG		(1 << 12)

#define TC2_CMR1_WAVE_EQ_1_EEVT_SHIFT		10
#define TC2_CMR1_WAVE_EQ_1_EEVT_MASK		0x03
/** @defgroup tc2_cmr1_wave_eq_1_eevt EEVT External Event Selection
@{*/
/**@}*/


#define TC2_CMR1_WAVE_EQ_1_EEVTEDG_SHIFT		8
#define TC2_CMR1_WAVE_EQ_1_EEVTEDG_MASK		0x03
/** @defgroup tc2_cmr1_wave_eq_1_eevtedg EEVTEDG External Event Edge Selection
@{*/
/**@}*/

/** TC2_CMR1_WAVE_EQ_1_CPCDIS Counter Clock Disable with RC Compare **/
#define TC2_CMR1_WAVE_EQ_1_CPCDIS		(1 << 7)
/** TC2_CMR1_WAVE_EQ_1_CPCSTOP Counter Clock Stopped with RC Compare **/
#define TC2_CMR1_WAVE_EQ_1_CPCSTOP		(1 << 6)

#define TC2_CMR1_WAVE_EQ_1_BURST_SHIFT		4
#define TC2_CMR1_WAVE_EQ_1_BURST_MASK		0x03
/** @defgroup tc2_cmr1_wave_eq_1_burst BURST Burst Signal Selection
@{*/
/**@}*/

/** TC2_CMR1_WAVE_EQ_1_CLKI Clock Invert **/
#define TC2_CMR1_WAVE_EQ_1_CLKI		(1 << 3)

#define TC2_CMR1_WAVE_EQ_1_TCCLKS_SHIFT		0
#define TC2_CMR1_WAVE_EQ_1_TCCLKS_MASK		0x07
/** @defgroup tc2_cmr1_wave_eq_1_tcclks TCCLKS Clock Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup tc2_smmr1 SMMR1 Stepper Motor Mode Register (channel = 1)
@{*/

/** TC2_SMMR1_DOWN DOWN Count **/
#define TC2_SMMR1_DOWN		(1 << 1)
/** TC2_SMMR1_GCEN Gray Count Enable **/
#define TC2_SMMR1_GCEN		(1 << 0)

/**@}*/

/** @defgroup tc2_cv1 CV1 Counter Value (channel = 1)
@{*/


#define TC2_CV1_CV_SHIFT		0
#define TC2_CV1_CV_MASK		0xffffffff
/** @defgroup tc2_cv1_cv CV Counter Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tc2_ra1 RA1 Register A (channel = 1)
@{*/


#define TC2_RA1_RA_SHIFT		0
#define TC2_RA1_RA_MASK		0xffffffff
/** @defgroup tc2_ra1_ra RA Register A
@{*/
/**@}*/


/**@}*/

/** @defgroup tc2_rb1 RB1 Register B (channel = 1)
@{*/


#define TC2_RB1_RB_SHIFT		0
#define TC2_RB1_RB_MASK		0xffffffff
/** @defgroup tc2_rb1_rb RB Register B
@{*/
/**@}*/


/**@}*/

/** @defgroup tc2_rc1 RC1 Register C (channel = 1)
@{*/


#define TC2_RC1_RC_SHIFT		0
#define TC2_RC1_RC_MASK		0xffffffff
/** @defgroup tc2_rc1_rc RC Register C
@{*/
/**@}*/


/**@}*/

/** @defgroup tc2_sr1 SR1 Status Register (channel = 1)
@{*/

/** TC2_SR1_MTIOB TIOB Mirror **/
#define TC2_SR1_MTIOB		(1 << 18)
/** TC2_SR1_MTIOA TIOA Mirror **/
#define TC2_SR1_MTIOA		(1 << 17)
/** TC2_SR1_CLKSTA Clock Enabling Status **/
#define TC2_SR1_CLKSTA		(1 << 16)
/** TC2_SR1_ETRGS External Trigger Status **/
#define TC2_SR1_ETRGS		(1 << 7)
/** TC2_SR1_LDRBS RB Loading Status **/
#define TC2_SR1_LDRBS		(1 << 6)
/** TC2_SR1_LDRAS RA Loading Status **/
#define TC2_SR1_LDRAS		(1 << 5)
/** TC2_SR1_CPCS RC Compare Status **/
#define TC2_SR1_CPCS		(1 << 4)
/** TC2_SR1_CPBS RB Compare Status **/
#define TC2_SR1_CPBS		(1 << 3)
/** TC2_SR1_CPAS RA Compare Status **/
#define TC2_SR1_CPAS		(1 << 2)
/** TC2_SR1_LOVRS Load Overrun Status **/
#define TC2_SR1_LOVRS		(1 << 1)
/** TC2_SR1_COVFS Counter Overflow Status **/
#define TC2_SR1_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc2_ier1 IER1 Interrupt Enable Register (channel = 1)
@{*/

/** TC2_IER1_ETRGS External Trigger **/
#define TC2_IER1_ETRGS		(1 << 7)
/** TC2_IER1_LDRBS RB Loading **/
#define TC2_IER1_LDRBS		(1 << 6)
/** TC2_IER1_LDRAS RA Loading **/
#define TC2_IER1_LDRAS		(1 << 5)
/** TC2_IER1_CPCS RC Compare **/
#define TC2_IER1_CPCS		(1 << 4)
/** TC2_IER1_CPBS RB Compare **/
#define TC2_IER1_CPBS		(1 << 3)
/** TC2_IER1_CPAS RA Compare **/
#define TC2_IER1_CPAS		(1 << 2)
/** TC2_IER1_LOVRS Load Overrun **/
#define TC2_IER1_LOVRS		(1 << 1)
/** TC2_IER1_COVFS Counter Overflow **/
#define TC2_IER1_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc2_idr1 IDR1 Interrupt Disable Register (channel = 1)
@{*/

/** TC2_IDR1_ETRGS External Trigger **/
#define TC2_IDR1_ETRGS		(1 << 7)
/** TC2_IDR1_LDRBS RB Loading **/
#define TC2_IDR1_LDRBS		(1 << 6)
/** TC2_IDR1_LDRAS RA Loading **/
#define TC2_IDR1_LDRAS		(1 << 5)
/** TC2_IDR1_CPCS RC Compare **/
#define TC2_IDR1_CPCS		(1 << 4)
/** TC2_IDR1_CPBS RB Compare **/
#define TC2_IDR1_CPBS		(1 << 3)
/** TC2_IDR1_CPAS RA Compare **/
#define TC2_IDR1_CPAS		(1 << 2)
/** TC2_IDR1_LOVRS Load Overrun **/
#define TC2_IDR1_LOVRS		(1 << 1)
/** TC2_IDR1_COVFS Counter Overflow **/
#define TC2_IDR1_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc2_imr1 IMR1 Interrupt Mask Register (channel = 1)
@{*/

/** TC2_IMR1_ETRGS External Trigger **/
#define TC2_IMR1_ETRGS		(1 << 7)
/** TC2_IMR1_LDRBS RB Loading **/
#define TC2_IMR1_LDRBS		(1 << 6)
/** TC2_IMR1_LDRAS RA Loading **/
#define TC2_IMR1_LDRAS		(1 << 5)
/** TC2_IMR1_CPCS RC Compare **/
#define TC2_IMR1_CPCS		(1 << 4)
/** TC2_IMR1_CPBS RB Compare **/
#define TC2_IMR1_CPBS		(1 << 3)
/** TC2_IMR1_CPAS RA Compare **/
#define TC2_IMR1_CPAS		(1 << 2)
/** TC2_IMR1_LOVRS Load Overrun **/
#define TC2_IMR1_LOVRS		(1 << 1)
/** TC2_IMR1_COVFS Counter Overflow **/
#define TC2_IMR1_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc2_ccr2 CCR2 Channel Control Register (channel = 2)
@{*/

/** TC2_CCR2_SWTRG Software Trigger Command **/
#define TC2_CCR2_SWTRG		(1 << 2)
/** TC2_CCR2_CLKDIS Counter Clock Disable Command **/
#define TC2_CCR2_CLKDIS		(1 << 1)
/** TC2_CCR2_CLKEN Counter Clock Enable Command **/
#define TC2_CCR2_CLKEN		(1 << 0)

/**@}*/

