grevaillot/svd_tools/headers/ATSAM3X8H/tc2.h
/** @defgroup tc2_cmr2 CMR2 Channel Mode Register (channel = 2)
@{*/


#define TC2_CMR2_LDRB_SHIFT		18
#define TC2_CMR2_LDRB_MASK		0x03
/** @defgroup tc2_cmr2_ldrb LDRB RB Loading Edge Selection
@{*/
/**@}*/


#define TC2_CMR2_LDRA_SHIFT		16
#define TC2_CMR2_LDRA_MASK		0x03
/** @defgroup tc2_cmr2_ldra LDRA RA Loading Edge Selection
@{*/
/**@}*/

/** TC2_CMR2_WAVE Waveform Mode **/
#define TC2_CMR2_WAVE		(1 << 15)
/** TC2_CMR2_CPCTRG RC Compare Trigger Enable **/
#define TC2_CMR2_CPCTRG		(1 << 14)
/** TC2_CMR2_ABETRG TIOA or TIOB External Trigger Selection **/
#define TC2_CMR2_ABETRG		(1 << 10)

#define TC2_CMR2_ETRGEDG_SHIFT		8
#define TC2_CMR2_ETRGEDG_MASK		0x03
/** @defgroup tc2_cmr2_etrgedg ETRGEDG External Trigger Edge Selection
@{*/
/**@}*/

/** TC2_CMR2_LDBDIS Counter Clock Disable with RB Loading **/
#define TC2_CMR2_LDBDIS		(1 << 7)
/** TC2_CMR2_LDBSTOP Counter Clock Stopped with RB Loading **/
#define TC2_CMR2_LDBSTOP		(1 << 6)

#define TC2_CMR2_BURST_SHIFT		4
#define TC2_CMR2_BURST_MASK		0x03
/** @defgroup tc2_cmr2_burst BURST Burst Signal Selection
@{*/
/**@}*/

/** TC2_CMR2_CLKI Clock Invert **/
#define TC2_CMR2_CLKI		(1 << 3)

#define TC2_CMR2_TCCLKS_SHIFT		0
#define TC2_CMR2_TCCLKS_MASK		0x07
/** @defgroup tc2_cmr2_tcclks TCCLKS Clock Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup tc2_cmr2_wave_eq_1 CMR2WAVEEQ1 Channel Mode Register (channel = 2)
@{*/


#define TC2_CMR2_WAVE_EQ_1_BSWTRG_SHIFT		30
#define TC2_CMR2_WAVE_EQ_1_BSWTRG_MASK		0x03
/** @defgroup tc2_cmr2_wave_eq_1_bswtrg BSWTRG Software Trigger Effect on TIOB
@{*/
/**@}*/


#define TC2_CMR2_WAVE_EQ_1_BEEVT_SHIFT		28
#define TC2_CMR2_WAVE_EQ_1_BEEVT_MASK		0x03
/** @defgroup tc2_cmr2_wave_eq_1_beevt BEEVT External Event Effect on TIOB
@{*/
/**@}*/


#define TC2_CMR2_WAVE_EQ_1_BCPC_SHIFT		26
#define TC2_CMR2_WAVE_EQ_1_BCPC_MASK		0x03
/** @defgroup tc2_cmr2_wave_eq_1_bcpc BCPC RC Compare Effect on TIOB
@{*/
/**@}*/


#define TC2_CMR2_WAVE_EQ_1_BCPB_SHIFT		24
#define TC2_CMR2_WAVE_EQ_1_BCPB_MASK		0x03
/** @defgroup tc2_cmr2_wave_eq_1_bcpb BCPB RB Compare Effect on TIOB
@{*/
/**@}*/


#define TC2_CMR2_WAVE_EQ_1_ASWTRG_SHIFT		22
#define TC2_CMR2_WAVE_EQ_1_ASWTRG_MASK		0x03
/** @defgroup tc2_cmr2_wave_eq_1_aswtrg ASWTRG Software Trigger Effect on TIOA
@{*/
/**@}*/


#define TC2_CMR2_WAVE_EQ_1_AEEVT_SHIFT		20
#define TC2_CMR2_WAVE_EQ_1_AEEVT_MASK		0x03
/** @defgroup tc2_cmr2_wave_eq_1_aeevt AEEVT External Event Effect on TIOA
@{*/
/**@}*/


#define TC2_CMR2_WAVE_EQ_1_ACPC_SHIFT		18
#define TC2_CMR2_WAVE_EQ_1_ACPC_MASK		0x03
/** @defgroup tc2_cmr2_wave_eq_1_acpc ACPC RC Compare Effect on TIOA
@{*/
/**@}*/


#define TC2_CMR2_WAVE_EQ_1_ACPA_SHIFT		16
#define TC2_CMR2_WAVE_EQ_1_ACPA_MASK		0x03
/** @defgroup tc2_cmr2_wave_eq_1_acpa ACPA RA Compare Effect on TIOA
@{*/
/**@}*/

/** TC2_CMR2_WAVE_EQ_1_WAVE Waveform Mode **/
#define TC2_CMR2_WAVE_EQ_1_WAVE		(1 << 15)

#define TC2_CMR2_WAVE_EQ_1_WAVSEL_SHIFT		13
#define TC2_CMR2_WAVE_EQ_1_WAVSEL_MASK		0x03
/** @defgroup tc2_cmr2_wave_eq_1_wavsel WAVSEL Waveform Selection
@{*/
/**@}*/

/** TC2_CMR2_WAVE_EQ_1_ENETRG External Event Trigger Enable **/
#define TC2_CMR2_WAVE_EQ_1_ENETRG		(1 << 12)

#define TC2_CMR2_WAVE_EQ_1_EEVT_SHIFT		10
#define TC2_CMR2_WAVE_EQ_1_EEVT_MASK		0x03
/** @defgroup tc2_cmr2_wave_eq_1_eevt EEVT External Event Selection
@{*/
/**@}*/


#define TC2_CMR2_WAVE_EQ_1_EEVTEDG_SHIFT		8
#define TC2_CMR2_WAVE_EQ_1_EEVTEDG_MASK		0x03
/** @defgroup tc2_cmr2_wave_eq_1_eevtedg EEVTEDG External Event Edge Selection
@{*/
/**@}*/

/** TC2_CMR2_WAVE_EQ_1_CPCDIS Counter Clock Disable with RC Compare **/
#define TC2_CMR2_WAVE_EQ_1_CPCDIS		(1 << 7)
/** TC2_CMR2_WAVE_EQ_1_CPCSTOP Counter Clock Stopped with RC Compare **/
#define TC2_CMR2_WAVE_EQ_1_CPCSTOP		(1 << 6)

#define TC2_CMR2_WAVE_EQ_1_BURST_SHIFT		4
#define TC2_CMR2_WAVE_EQ_1_BURST_MASK		0x03
/** @defgroup tc2_cmr2_wave_eq_1_burst BURST Burst Signal Selection
@{*/
/**@}*/

/** TC2_CMR2_WAVE_EQ_1_CLKI Clock Invert **/
#define TC2_CMR2_WAVE_EQ_1_CLKI		(1 << 3)

#define TC2_CMR2_WAVE_EQ_1_TCCLKS_SHIFT		0
#define TC2_CMR2_WAVE_EQ_1_TCCLKS_MASK		0x07
/** @defgroup tc2_cmr2_wave_eq_1_tcclks TCCLKS Clock Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup tc2_smmr2 SMMR2 Stepper Motor Mode Register (channel = 2)
@{*/

/** TC2_SMMR2_DOWN DOWN Count **/
#define TC2_SMMR2_DOWN		(1 << 1)
/** TC2_SMMR2_GCEN Gray Count Enable **/
#define TC2_SMMR2_GCEN		(1 << 0)

/**@}*/

/** @defgroup tc2_cv2 CV2 Counter Value (channel = 2)
@{*/


#define TC2_CV2_CV_SHIFT		0
#define TC2_CV2_CV_MASK		0xffffffff
/** @defgroup tc2_cv2_cv CV Counter Value
@{*/
/**@}*/


/**@}*/

/** @defgroup tc2_ra2 RA2 Register A (channel = 2)
@{*/


#define TC2_RA2_RA_SHIFT		0
#define TC2_RA2_RA_MASK		0xffffffff
/** @defgroup tc2_ra2_ra RA Register A
@{*/
/**@}*/


/**@}*/

/** @defgroup tc2_rb2 RB2 Register B (channel = 2)
@{*/


#define TC2_RB2_RB_SHIFT		0
#define TC2_RB2_RB_MASK		0xffffffff
/** @defgroup tc2_rb2_rb RB Register B
@{*/
/**@}*/


/**@}*/

/** @defgroup tc2_rc2 RC2 Register C (channel = 2)
@{*/


#define TC2_RC2_RC_SHIFT		0
#define TC2_RC2_RC_MASK		0xffffffff
/** @defgroup tc2_rc2_rc RC Register C
@{*/
/**@}*/


/**@}*/

/** @defgroup tc2_sr2 SR2 Status Register (channel = 2)
@{*/

/** TC2_SR2_MTIOB TIOB Mirror **/
#define TC2_SR2_MTIOB		(1 << 18)
/** TC2_SR2_MTIOA TIOA Mirror **/
#define TC2_SR2_MTIOA		(1 << 17)
/** TC2_SR2_CLKSTA Clock Enabling Status **/
#define TC2_SR2_CLKSTA		(1 << 16)
/** TC2_SR2_ETRGS External Trigger Status **/
#define TC2_SR2_ETRGS		(1 << 7)
/** TC2_SR2_LDRBS RB Loading Status **/
#define TC2_SR2_LDRBS		(1 << 6)
/** TC2_SR2_LDRAS RA Loading Status **/
#define TC2_SR2_LDRAS		(1 << 5)
/** TC2_SR2_CPCS RC Compare Status **/
#define TC2_SR2_CPCS		(1 << 4)
/** TC2_SR2_CPBS RB Compare Status **/
#define TC2_SR2_CPBS		(1 << 3)
/** TC2_SR2_CPAS RA Compare Status **/
#define TC2_SR2_CPAS		(1 << 2)
/** TC2_SR2_LOVRS Load Overrun Status **/
#define TC2_SR2_LOVRS		(1 << 1)
/** TC2_SR2_COVFS Counter Overflow Status **/
#define TC2_SR2_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc2_ier2 IER2 Interrupt Enable Register (channel = 2)
@{*/

/** TC2_IER2_ETRGS External Trigger **/
#define TC2_IER2_ETRGS		(1 << 7)
/** TC2_IER2_LDRBS RB Loading **/
#define TC2_IER2_LDRBS		(1 << 6)
/** TC2_IER2_LDRAS RA Loading **/
#define TC2_IER2_LDRAS		(1 << 5)
/** TC2_IER2_CPCS RC Compare **/
#define TC2_IER2_CPCS		(1 << 4)
/** TC2_IER2_CPBS RB Compare **/
#define TC2_IER2_CPBS		(1 << 3)
/** TC2_IER2_CPAS RA Compare **/
#define TC2_IER2_CPAS		(1 << 2)
/** TC2_IER2_LOVRS Load Overrun **/
#define TC2_IER2_LOVRS		(1 << 1)
/** TC2_IER2_COVFS Counter Overflow **/
#define TC2_IER2_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc2_idr2 IDR2 Interrupt Disable Register (channel = 2)
@{*/

/** TC2_IDR2_ETRGS External Trigger **/
#define TC2_IDR2_ETRGS		(1 << 7)
/** TC2_IDR2_LDRBS RB Loading **/
#define TC2_IDR2_LDRBS		(1 << 6)
/** TC2_IDR2_LDRAS RA Loading **/
#define TC2_IDR2_LDRAS		(1 << 5)
/** TC2_IDR2_CPCS RC Compare **/
#define TC2_IDR2_CPCS		(1 << 4)
/** TC2_IDR2_CPBS RB Compare **/
#define TC2_IDR2_CPBS		(1 << 3)
/** TC2_IDR2_CPAS RA Compare **/
#define TC2_IDR2_CPAS		(1 << 2)
/** TC2_IDR2_LOVRS Load Overrun **/
#define TC2_IDR2_LOVRS		(1 << 1)
/** TC2_IDR2_COVFS Counter Overflow **/
#define TC2_IDR2_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc2_imr2 IMR2 Interrupt Mask Register (channel = 2)
@{*/

