grevaillot/svd_tools/headers/ATSAM3X8H/tc2.h
/** TC2_IMR2_ETRGS External Trigger **/
#define TC2_IMR2_ETRGS		(1 << 7)
/** TC2_IMR2_LDRBS RB Loading **/
#define TC2_IMR2_LDRBS		(1 << 6)
/** TC2_IMR2_LDRAS RA Loading **/
#define TC2_IMR2_LDRAS		(1 << 5)
/** TC2_IMR2_CPCS RC Compare **/
#define TC2_IMR2_CPCS		(1 << 4)
/** TC2_IMR2_CPBS RB Compare **/
#define TC2_IMR2_CPBS		(1 << 3)
/** TC2_IMR2_CPAS RA Compare **/
#define TC2_IMR2_CPAS		(1 << 2)
/** TC2_IMR2_LOVRS Load Overrun **/
#define TC2_IMR2_LOVRS		(1 << 1)
/** TC2_IMR2_COVFS Counter Overflow **/
#define TC2_IMR2_COVFS		(1 << 0)

/**@}*/

/** @defgroup tc2_bcr BCR Block Control Register
@{*/

/** TC2_BCR_SYNC Synchro Command **/
#define TC2_BCR_SYNC		(1 << 0)

/**@}*/

/** @defgroup tc2_bmr BMR Block Mode Register
@{*/


#define TC2_BMR_MAXFILT_SHIFT		20
#define TC2_BMR_MAXFILT_MASK		0x3f
/** @defgroup tc2_bmr_maxfilt MAXFILT MAXimum FILTer
@{*/
/**@}*/

/** TC2_BMR_FILTER  **/
#define TC2_BMR_FILTER		(1 << 19)
/** TC2_BMR_IDXPHB InDeX pin is PHB pin **/
#define TC2_BMR_IDXPHB		(1 << 17)
/** TC2_BMR_SWAP SWAP PHA and PHB **/
#define TC2_BMR_SWAP		(1 << 16)
/** TC2_BMR_INVIDX INVerted InDeX **/
#define TC2_BMR_INVIDX		(1 << 15)
/** TC2_BMR_INVB INVerted phB **/
#define TC2_BMR_INVB		(1 << 14)
/** TC2_BMR_INVA INVerted phA **/
#define TC2_BMR_INVA		(1 << 13)
/** TC2_BMR_EDGPHA EDGe on PHA count mode **/
#define TC2_BMR_EDGPHA		(1 << 12)
/** TC2_BMR_QDTRANS Quadrature Decoding TRANSparent **/
#define TC2_BMR_QDTRANS		(1 << 11)
/** TC2_BMR_SPEEDEN SPEED ENabled **/
#define TC2_BMR_SPEEDEN		(1 << 10)
/** TC2_BMR_POSEN POSition ENabled **/
#define TC2_BMR_POSEN		(1 << 9)
/** TC2_BMR_QDEN Quadrature Decoder ENabled **/
#define TC2_BMR_QDEN		(1 << 8)

#define TC2_BMR_TC2XC2S_SHIFT		4
#define TC2_BMR_TC2XC2S_MASK		0x03
/** @defgroup tc2_bmr_tc2xc2s TC2XC2S External Clock Signal 2 Selection
@{*/
/**@}*/


#define TC2_BMR_TC1XC1S_SHIFT		2
#define TC2_BMR_TC1XC1S_MASK		0x03
/** @defgroup tc2_bmr_tc1xc1s TC1XC1S External Clock Signal 1 Selection
@{*/
/**@}*/


#define TC2_BMR_TC0XC0S_SHIFT		0
#define TC2_BMR_TC0XC0S_MASK		0x03
/** @defgroup tc2_bmr_tc0xc0s TC0XC0S External Clock Signal 0 Selection
@{*/
/**@}*/


/**@}*/

/** @defgroup tc2_qier QIER QDEC Interrupt Enable Register
@{*/

/** TC2_QIER_QERR Quadrature ERRor **/
#define TC2_QIER_QERR		(1 << 2)
/** TC2_QIER_DIRCHG DIRection CHanGe **/
#define TC2_QIER_DIRCHG		(1 << 1)
/** TC2_QIER_IDX InDeX **/
#define TC2_QIER_IDX		(1 << 0)

/**@}*/

/** @defgroup tc2_qidr QIDR QDEC Interrupt Disable Register
@{*/

/** TC2_QIDR_QERR Quadrature ERRor **/
#define TC2_QIDR_QERR		(1 << 2)
/** TC2_QIDR_DIRCHG DIRection CHanGe **/
#define TC2_QIDR_DIRCHG		(1 << 1)
/** TC2_QIDR_IDX InDeX **/
#define TC2_QIDR_IDX		(1 << 0)

/**@}*/

/** @defgroup tc2_qimr QIMR QDEC Interrupt Mask Register
@{*/

/** TC2_QIMR_QERR Quadrature ERRor **/
#define TC2_QIMR_QERR		(1 << 2)
/** TC2_QIMR_DIRCHG DIRection CHanGe **/
#define TC2_QIMR_DIRCHG		(1 << 1)
/** TC2_QIMR_IDX InDeX **/
#define TC2_QIMR_IDX		(1 << 0)

/**@}*/

/** @defgroup tc2_qisr QISR QDEC Interrupt Status Register
@{*/

/** TC2_QISR_DIR DIRection **/
#define TC2_QISR_DIR		(1 << 8)
/** TC2_QISR_QERR Quadrature ERRor **/
#define TC2_QISR_QERR		(1 << 2)
/** TC2_QISR_DIRCHG DIRection CHanGe **/
#define TC2_QISR_DIRCHG		(1 << 1)
/** TC2_QISR_IDX InDeX **/
#define TC2_QISR_IDX		(1 << 0)

/**@}*/

/** @defgroup tc2_fmr FMR Fault Mode Register
@{*/

/** TC2_FMR_ENCF1 ENable Compare Fault Channel 1 **/
#define TC2_FMR_ENCF1		(1 << 1)
/** TC2_FMR_ENCF0 ENable Compare Fault Channel 0 **/
#define TC2_FMR_ENCF0		(1 << 0)

/**@}*/

/** @defgroup tc2_wpmr WPMR Write Protect Mode Register
@{*/


#define TC2_WPMR_WPKEY_SHIFT		8
#define TC2_WPMR_WPKEY_MASK		0xffffff
/** @defgroup tc2_wpmr_wpkey WPKEY Write Protect KEY
@{*/
/**@}*/

/** TC2_WPMR_WPEN Write Protect Enable **/
#define TC2_WPMR_WPEN		(1 << 0)

/**@}*/
